{
  "anecdotes": [
    {
      "content": "If it hurts, do it more often",
      "id": "47145",
      "votes": 3
    },
    {
      "content": "Adding manpower to a late software project makes it later!",
      "id": "21149",
      "votes": 2
    },
    {
      "content": "The first 90 percent of the code accounts for the first 90 percent of the development time...The remaining 10 percent of the code accounts for the other 90 percent of the development time.",
      "id": "69581",
      "votes": 1
    },
    {
      "content": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.",
      "id": "36975",
      "votes": 0
    },
    {
      "content": "Premature optimization is the root of all evil.",
      "id": "25170",
      "votes": 1
    },
    {
      "content": "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.",
      "id": "98312",
      "votes": 1
    },
    {
      "content": "I told the Wi-Fi it was being slow. Now it’s feeling insecure.",
      "votes": 1,
      "id": "xqO5k8f"
    },
    {
      "content": "Why do Java developers wear glasses? Because they don’t C#.",
      "votes": 2,
      "id": "bO8PZb_"
    },
    {
      "content": "I love pressing F5. It’s so refreshing.",
      "votes": 4,
      "id": "nZXGXOT"
    },
    {
      "content": "Why was the computer cold? It left its Windows open.",
      "votes": 2,
      "id": "pNIn_71"
    },
    {
      "content": "Why did the developer become so poor?... Because he cleared his cache.",
      "votes": 0,
      "id": "kZ_3u1Y"
    },
    {
      "content": "A computer will do what you tell it to do, but that may be much different from what you had in mind.",
      "votes": 1,
      "id": "Adv_k8-"
    },
    {
      "content": "The real danger is not that computers will begin to think like men but that men will begin to think like computers",
      "votes": 1,
      "id": "NO7Q0Yg"
    },
    {
      "content": "Whoever said that the definition of insanity is doing the same thing over and over again and expecting different results has never had to reboot a computer.",
      "votes": 3,
      "id": "72vWOxa"
    },
    {
      "content": "Technology…is a queer thing. It brings you great gifts with one hand, and it stabs you in the back with the other",
      "votes": 0,
      "id": "-_yT9GX"
    },
    {
      "content": "It has become obvious that our technology has exceeded our humanity.",
      "votes": 1,
      "id": "kcGGPBb"
    },
    {
      "content": "Man is a slow, sloppy, and brilliant thinker; the machine is fast, accurate, and stupid",
      "votes": 2,
      "id": "eA9MYt1"
    },
    {
      "content": "Once a new technology rolls over you, if you’re not part of the steamroller, you’re part of the road",
      "votes": 1,
      "id": "LxP37Ul"
    },
    {
      "content": "One machine can do the work of 50 ordinary men. No machine can do the work of one extraordinary man.",
      "votes": 0,
      "id": "YaTUyHP"
    }
  ]
}